---
kind: property
id: P:Autodesk.Revit.DB.InSessionPrintSetting.PrintParameters
source: html/e593c73f-0550-bc9f-2bdf-639797f4c1a6.htm
---
# Autodesk.Revit.DB.InSessionPrintSetting.PrintParameters Property

Returns the Parameters of Print Setup.

## Syntax (C#)
```csharp
public virtual PrintParameters PrintParameters { get; }
```

## Remarks
The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.